base/Catalogs/бит_вго_НастройкиАктовСверкиВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_вго_НастройкиАктовСверкиВГО</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноВыбиратьОперациюВГО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСчетРасчетов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСчетОборотов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСчетОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешеноВыбиратьСубконто_1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешеноВыбиратьСубконто_2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешеноВыбиратьСубконто_3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешеноВыбиратьСубконто_4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполненияСубконто_1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполненияСубконто_2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполненияСубконто_3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполненияСубконто_4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_вго_НастройкиАктовСверкиВГО/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьКэшЗначений();
	
	// Имя регистра бухгалтерии.
	УстановитьИмяРегистраБухгалтерии();
	УстановитьВидимостьДоступность();
	
	УстановитьПараметрыВыбораДляСчетов();
	
	// Управление отображением счетов субконто.
	фКоличествоСубконто = 4;
	ОформитьСчета();
	ВосстановитьНастройкиОформленияПоСчету();
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВосстановитьНастройкиОформленияПоСчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("РегистрБухгалтерии");
	                                              		
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрБухгалтерииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(фКэшЗначений.ВидОбъектаРегистрБухгалтерии);	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов", 		   СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы",    Объект.РегистрБухгалтерии);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фКэшЗначений.СписокДоступныхРегистров);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрБухгалтерииПриИзменении(Элемент)
	
	Если Объект.РегистрБухгалтерии <> мКэшРеквизитовФормы.РегистрБухгалтерии Тогда
		
		НужноОчистить = Истина;
		Если Объект.Счета.Количество() > 0 Тогда
			
			Оповещение = Новый ОписаниеОповещения("РегистрБухгалтерииПриИзмененииЗавершение", ЭтотОбъект);
			ТекстВопроса = НСтр("ru='Таблица счетов будет очищена. Продолжить?';
								|en='Accounts table will be cleared. Continue?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
			
		Иначе
			
			Если НужноОчистить Тогда 
				ИзменениеРегистраБухгалтерииСервер();
				ДобавитьВКэш("РегистрБухгалтерии");
			Иначе
				ИзвлечьИзКэша("РегистрБухгалтерии");	
			КонецЕсли;
			
		КонецЕсли;				  
			
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет действия при завершении изменения реквизита "РегистрБухгалтерии".
// 
&НаКлиенте
Процедура РегистрБухгалтерииПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	НужноОчистить = Ответ = КодВозвратаДиалога.Да;
	
	Если НужноОчистить Тогда 
		ИзменениеРегистраБухгалтерииСервер();
		ДобавитьВКэш("РегистрБухгалтерии");
	Иначе
		ИзвлечьИзКэша("РегистрБухгалтерии");	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСчета

&НаКлиенте
Процедура СчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не Копирование Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.Счета.Добавить();
		НоваяСтрока.Счет = Элементы.СчетаСчет.ДоступныеТипы.ПривестиЗначение(НоваяСтрока.Счет);
				
		Элементы.Счета.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПланСчетовСуществет(ИмяПланаСчетов) Тогда
		Возврат;
	КонецЕсли;
		
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	Если ТекущиеДанные.Счет = Неопределено Тогда
		ТекущиеДанные.Счет = Элемент.ДоступныеТипы.ПривестиЗначение(ТекущиеДанные.Счет);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ТекущаяСтрока", ТекущиеДанные.Счет);
	Попытка
		ИмяФормы = СтрШаблон("ПланСчетов.%1.ФормаВыбора", ИмяПланаСчетов);
		ОткрытьФорму(ИмяФормы, ПараметрыФормы, Элемент)
    Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаСчетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	УстановитьПараметрыОформленияПоСчету(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаРазрешеноВыбиратьСубконтоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	
	ИмяТекущего = Элемент.Имя;
	Если Не ТекущиеДанные[СтрЗаменить(ИмяТекущего, "Счета", "")] Тогда
		ИмяРеквизита = "ПроверкаЗаполненияСубконто_" + СтрЗаменить(ИмяТекущего, "СчетаРазрешеноВыбиратьСубконто_", "");
	    ТекущиеДанные[ИмяРеквизита] = Ложь;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СчетаПроверкаЗаполненияСубконтоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	
	ИмяТекущего = Элемент.Имя;
	Если ТекущиеДанные[СтрЗаменить(ИмяТекущего, "Счета", "")] Тогда
		ИмяРеквизита = "РазрешеноВыбиратьСубконто_" + СтрЗаменить(ИмяТекущего, "СчетаПроверкаЗаполненияСубконто_", "");
	    ТекущиеДанные[ИмяРеквизита] = Истина;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СчетаЭтоСчетРасчетовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоСчетРасчетов Тогда
		ТекущиеДанные.ЭтоСчетОплаты = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СчетаЭтоСчетОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоСчетОборотов Тогда
		ТекущиеДанные.ЭтоСчетОплаты = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СчетаЭтоСчетОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоСчетОплаты Тогда
		ТекущиеДанные.ЭтоСчетРасчетов = Ложь;
		ТекущиеДанные.ЭтоСчетОборотов = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаФлажкиКолокниУстановить(Команда)
	
	ИзменитьФлажкиДляКолонки(1);
	
КонецПроцедуры
   
&НаКлиенте
Процедура КомандаФлажкиКолокниСнять(Команда)
	
	ИзменитьФлажкиДляКолонки(2);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаФлажкиКолокниИнвертировать(Команда)
	
	ИзменитьФлажкиДляКолонки(3);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСчетРасчета(Команда)
	
	ИзменитьОсновнойПризнак("ЭтоСчетРасчетов");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСчетОборотов(Команда)
	
	ИзменитьОсновнойПризнак("ЭтоСчетОборотов");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСчетОплаты(Команда)
	
	ИзменитьОсновнойПризнак("ЭтоСчетОплаты");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьПодчиненные(Команда)
	
	ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.Счет) Тогда
		Возврат;	
	КонецЕсли;
	
	ДобавитьПодчиненныеСтроки(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

// Процедура извлекает из кэша и присваивает объекту значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = мКэшРеквизитовФормы[ИмяРеквизита];
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура меняет флажки для текущей колонки.
// 
// Параметры:
//  ВариантИзменения - Число.
// 
&НаКлиенте
Процедура ИзменитьФлажкиДляКолонки(ВариантИзменения)

	ТекущееПолеФормы = Элементы.Счета.ТекущийЭлемент;
	Если ТекущееПолеФормы.Вид = ВидПоляФормы.ПолеФлажка Тогда
		
		ИмяПоля = СтрЗаменить(ТекущееПолеФормы.Имя, "Счета", "");
		
		Для каждого СтрокаТабл Из Объект.Счета Цикл
			
			Если Найти(ИмяПоля, "Субконто") > 0 
				И Число(Прав(ИмяПоля, 1)) > СтрокаТабл.КоличествоДоступныхСубконто Тогда
				Продолжить;	
			КонецЕсли;
		
			Если ВариантИзменения = 1 Тогда
				СтрокаТабл[ИмяПоля] = Истина;
			ИначеЕсли ВариантИзменения = 2 Тогда 
				СтрокаТабл[ИмяПоля] = Ложь;
			Иначе
			    СтрокаТабл[ИмяПоля] = Не СтрокаТабл[ИмяПоля];
			КонецЕсли;                                       			 	
			
			Если СтрокаТабл[ИмяПоля] Тогда
				Если ИмяПоля = "ЭтоСчетРасчетов" ИЛИ ИмяПоля = "ЭтоСчетОборотов" Тогда
					СтрокаТабл.ЭтоСчетОплаты = Ложь;
				Иначе	
				    СтрокаТабл.ЭтоСчетРасчетов = Ложь;
					СтрокаТабл.ЭтоСчетОборотов = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли; 	

КонецПроцедуры

// Процедура - обработчик команды "КомандаСчетРасчета".
// 
// Параметры:
//  ИмяПоля - Строка.
// 
&НаКлиенте
Процедура ИзменитьОсновнойПризнак(ИмяПоля)
	
	Для каждого ИдВыделенной Из Элементы.Счета.ВыделенныеСтроки Цикл
		
		СтрокаТабл = Объект.Счета.НайтиПоИдентификатору(ИдВыделенной);
		СтрокаТабл[ИмяПоля] = Не СтрокаТабл[ИмяПоля];	
		
		Если СтрокаТабл[ИмяПоля] Тогда
			Если ИмяПоля = "ЭтоСчетРасчетов" ИЛИ ИмяПоля = "ЭтоСчетОборотов" Тогда
				СтрокаТабл.ЭтоСчетОплаты = Ложь;
			Иначе	
			    СтрокаТабл.ЭтоСчетРасчетов = Ложь;
				СтрокаТабл.ЭтоСчетОборотов = Ложь;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедурыИФункцииОбщегоНазначения

// Процедура устанвливает параметры выбора для элементов формы.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.СчетаСчет);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	фКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("ВидОбъектаРегистрБухгалтерии", Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии);
	фКэшЗначений.Вставить("СписокДоступныхРегистров", бит_вго_Сервер.СформироватьСписокДоступныхРегистровБухгалтерииДляСверкиВГО());
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
// 
&НаСервере 
Процедура УстановитьВидимостьДоступность()
	
	ТаблицаСчетовДоступна =  ЗначениеЗаполнено(Объект.РегистрБухгалтерии);
					
	Элементы.Счета.ТолькоПросмотр 				 = Не ТаблицаСчетовДоступна;
	Элементы.СчетаКомандаСчетРасчета.Доступность = ТаблицаСчетовДоступна;
			
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Это счет расчетов.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СчетаНомерСтроки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СчетаСчет.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Счета.ЭтоСчетРасчетов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ШрифтТекстаОбычныйПолужирный);
	
	// Количество доступных субконто меньше допустимого значения.
	Для Сч = 1 По 4 Цикл
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СчетаРазрешеноВыбиратьСубконто_" + Сч);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СчетаПроверкаЗаполненияСубконто_" + Сч);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Счета.КоличествоДоступныхСубконто");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		ОтборЭлемента.ПравоеЗначение = Сч;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветФонаГруппыИтоги);
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает имя регистра бухгалтерии.
// 
&НаСервере
Процедура УстановитьИмяРегистраБухгалтерии()

	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		ИмяРегистраБухгалтерии = Объект.РегистрБухгалтерии.ИмяОбъекта;
		ИмяПланаСчетов = Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].ПланСчетов.Имя;
	Иначе
	    ИмяРегистраБухгалтерии = "";
		ИмяПланаСчетов = "";
	КонецЕсли;         	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПланСчетовСуществет(Знач ИмяПланаСчетов)
	
	Возврат (Метаданные.ПланыСчетов.Найти(ИмяПланаСчетов) <> Неопределено);
	
КонецФункции

// Процедура добавляет подчиненные счета.
// 
// Параметры:
//  Идентификатор - Число.
// 
&НаСервере
Процедура ДобавитьПодчиненныеСтроки(Знач Идентификатор)

	ТекущиеДанные = Объект.Счета.НайтиПоИдентификатору(Идентификатор);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ТекущиеДанные.Счет);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТекПланСчетов.Ссылка КАК Счет,
	|	ТекПланСчетов.Родитель,
	|	ТекПланСчетов.Порядок КАК Порядок
	|ИЗ
	|	&ИмяПланаСчетов КАК ТекПланСчетов
	|ГДЕ
	|	ТекПланСчетов.Родитель В ИЕРАРХИИ(&Родитель)
    |
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПланаСчетов", СтрШаблон("ПланСчетов.%1", ИмяПланаСчетов));
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Счета.Добавить();
		НоваяСтрока.Счет = Выборка.Счет;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные, , "Счет");
	    УстановитьПараметрыОформленияПоСчету(НоваяСтрока.ПолучитьИдентификатор());	
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОформлениеСчетовИСубконто

// Процедура подсчитывает количество доступных субконто в строке тч.
// 
// Параметры:
//  Идентификатор - Число.
//  
&НаСервере
Процедура УстановитьПараметрыОформленияПоСчету(Знач Идентификатор)

	ТекущиеДанные = Объект.Счета.НайтиПоИдентификатору(Идентификатор);
	
	ТекущийСчет = ТекущиеДанные.Счет;
	Если ТекущийСчет <> Неопределено Тогда
	
		// Количество доступных субконто.
        СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущийСчет);
		КоличествоДоступных = СвСч.КоличествоСубконто;
		ТекущиеДанные.КоличествоДоступныхСубконто = КоличествоДоступных;
		
		Для i = 1 По фКоличествоСубконто Цикл
			НомерСтр = Строка(i);
			ИмяПоля = "РазрешеноВыбиратьСубконто_" + НомерСтр;
			ТекущиеДанные[ИмяПоля] = ТекущиеДанные[ИмяПоля] И Не КоличествоДоступных < i;
			ИмяПоля = "ПроверкаЗаполненияСубконто_" + НомерСтр;
		    ТекущиеДанные[ИмяПоля] = ТекущиеДанные[ИмяПоля] И Не КоличествоДоступных < i;
		КонецЦикла;
					
	КонецЕсли;
	 	
КонецПроцедуры

// Процедура восстанавливает настройки субконто в зависимости от счетов учета.
// 
&НаСервере
Процедура ВосстановитьНастройкиОформленияПоСчету()

	Для каждого СтрокаСчет Из Объект.Счета Цикл						
		УстановитьПараметрыОформленияПоСчету(СтрокаСчет.ПолучитьИдентификатор());		
	КонецЦикла;

КонецПроцедуры

// Процедура оформляет счета в табличной части по регистру бухгалтерии.
// 
&НаСервере
Процедура ОформитьСчета()
	
	Если Не ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипаДляСчетов = "ПланСчетовСсылка." + ИмяПланаСчетов;
		
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип(ИмяТипаДляСчетов));
	ОписаниеТиповСчета = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.СчетаСчет.ВыбиратьТип   = Ложь;
	Элементы.СчетаСчет.ДоступныеТипы = ОписаниеТиповСчета;
	
КонецПроцедуры

// Процедура выполняет действия необходимые при изменении регистра бухгалтерии.
// 
&НаСервере
Процедура ИзменениеРегистраБухгалтерииСервер()

	// Очистка табличной части.
	Объект.Счета.Очистить();
	
	УстановитьИмяРегистраБухгалтерии();
	УстановитьВидимостьДоступность();
	
	ОформитьСчета();
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти
